; Generated (28.09.2022 21:08:52) by Firewall App Blocker v1.9 - Freeware
; www.sordum.org

[Main]
Language=Simplified Chinese_简体中文
WinSetOnTop=0
ShowOutboundRules=1
SelectedRules=0
ActionType=2
ShowStatusIndicates=1
SkipSvcHostFile=0
UseShiftKey=0
GridLines=1
FolderFileCount=50
Font=Tahoma|10|400|0
WinPos=934,606,555,291
ColumnPos=200,100,100,280,0
ColumnShortOpt=-1

[Netsh_Commands]
;https://support.microsoft.com/en-us/help/947709
_=_
&Netsh Sample Rule=advfirewall firewall add rule name="- Example Block" dir=in action=block program="%ProgramFiles%\MyApp\MyApp.exe" enable=yes
&Netsh Sample Rule=advfirewall firewall add rule name="- Example Block" dir=out action=block program="%ProgramFiles%\MyApp\MyApp.exe" enable=yes
&Netsh Sample Rule - Del=advfirewall firewall delete rule name="- Example Block"
_=_
&Allow Local Subnet=advfirewall firewall add rule name="- Allow Local Subnet" dir=in action=allow enable=yes remoteip=localsubnet
&Allow Local Subnet=advfirewall firewall add rule name="- Allow Local Subnet" dir=out action=allow enable=yes remoteip=localsubnet
&Allow Local Subnet - Del=advfirewall firewall delete rule name="- Allow Local Subnet"

[Language_English]
Translator="BlueLife"
01="This software is designed to simplify the use of windows firewall"
02="&File\n &Edit\n &Firewall\n &Options\n &Help"
03="Name\n Enabled\n Action\n Location"
04="Yes\n No\n Allow\n Block"
05="Outbound Rules\n Inbound Rules"
06="Enable WhiteList\n Only Allowed applications can use internet"
07="Add Application"
08="Add Process"
09="Delete Selected"
10="Enable Selected"
11="Disable Selected"
12="Allow Selected"
13="Block Selected"
14="Import List"
15="Export List"
16="Firewall Settings"
17="&Add Application"
18="Add &Folder Contents"
19="&Add Process"
20="&Import List"
21="&Export List"
22="E&xit"
23="&Enable"
24="&Disable"
25="&Allow"
26="&Block"
27="&Paste"
28="&Delete"
29="&Rename"
30="&Copy Path"
31="&Select All"
32="&Invert Selection"
33="&All ..."
34="&Enable All"
35="&Disable All"
36="&Allow All"
37="&Block All"
38="&Delete All"
39="&Run The App"
40="&Open Location"
41="&File Properties"
42="&Refresh"
43="&Default Mode"
44="&Whitelist Mode"
45="&Block internet"
46="&Disable Firewall"
47="&Reset Firewall Settings"
48="&Restart Firewall Service"
49="&Firewall Settings"
50="&Restrict Firewall Access"
51="&Always On Top"
52="&Show Outbound Rules on Startup"
53="&Show Status Indicator"
54="&Show Grid Lines on List"
55="&Change the List Font"
56="&Add To Exe Context Menu"
57="&Use the Shift Key to Display"
58="&Show Hidden Files"
59="&Show File Extensions"
60="&Donate"
61="&Contact"
62="&HomePage"
63="&About"
64="Please Wait ..."
65="&Block In Windows Firewall"
66="&Remove From Windows Firewall"
67="&Launch Firewall App Blocker"
68="Select Applications"
69="Applications"
70="Select the folder in which Applications is stored"
71="There are more than #NUM applications in the selected folder. The process can take a very long time. Do you want to add only the first #NUM applications?"
72="Processes\n Name\n User\n Location\n Add selected items to the List"
73="Save As"
74="Open"
75="Configuration Files"
76="Warning!"
77="Restoring the default settings will delete all settings of Windows Firewall that you have made since Windows was installed.\nDo you want to continue?"
78="The Windows Firewall service could not be started!"
79="The Windows Firewall is not running!"
80="There is a problem with the Windows firewall configuration!"
81="Unable to create file!"
82="Unable to read file!"
83="The operation failed."
84="&Netsh Commands"
85="&Import Firewall Config"
86="&Export Firewall Config"

[Language_Simplified Chinese_简体中文]
Translator="胡萝卜周babyheyu"
01="This software is designed to simplify the use of windows firewall"
02="文件(&F)\n 编辑(&E)\n 防火墙(&F)\n 选项(&O)\n 帮助(&H)"
03="名称\n 启用\n 操作\n 位置"
04="是\n 否\n 允许\n 阻止"
05="出站规则\n 入站规则"
06="启用白名单\n 只有允许的应用程序才能联网"
07="添加应用程序"
08="添加进程"
09="删除所选"
10="启用所选"
11="禁用所选"
12="允许所选"
13="阻止所选"
14="导入列表"
15="导出列表"
16="防火墙设置"
17="添加应用程序(&A)"
18="添加文件夹内容(&F)"
19="添加进程(&A)"
20="导入列表(&I)"
21="导出列表(&E)"
22="退出(&X)"
23="启用(&E)"
24="禁用(&D)"
25="允许(&A)"
26="阻止(&B)"
27="粘贴(&P)"
28="删除(&D)"
29="重命名(&R)"
30="复制路径(&C)"
31="全选(&S)"
32="反选(&I)"
33="全部(&A) ..."
34="全部启用(&E)"
35="全部禁用(&D)"
36="全部允许(&A)"
37="阻止全部(&B)"
38="删除全部(&D)"
39="运行应用程序(&R)"
40="打开位置(&O)"
41="文件属性(&F)"
42="刷新(&R)"
43="默认模式(&D)"
44="白名单模式(&W)"
45="阻止网络(&B)"
46="禁用防火墙(&D)"
47="重置防火墙设置(&R)"
48="重新启动防火墙服务(&R)"
49="防火墙设置(&F)"
50="限制防火墙访问(&R)"
51="始终在顶部(&A)"
52="启动时显示出站规则(&S)"
53="显示状态指示灯(&S)"
54="显示网络线(&S)"
55="更改列表字体(&C)"
56="添加到 exe 文件右键菜单(&A)"
57="使用 Shift 键显示(&U)"
58="显示隐藏文件(&S)"
59="显示文件扩展名(&S)"
60="捐赠(&D)"
61="联系我们(&C)"
62="主页(&H)"
63="关于(&A)"
64="请稍候..."
65="在 Windows 防火墙中阻止(&B)"
66="在 Windows 防火墙中删除(&R)"
67="启动防火墙应用阻止程序(&L)"
68="选择程序"
69="程序"
70="选择应用程序所在的文件夹"
71="所选文件夹中有超过#NUM个应用程序。这个过程可能需要很长时间。您要仅添加前#NUM个应用程序吗？"
72="进程\n 名称\n 用户\n 位置\n 将所选项目添加到列表"
73="另存为"
74="打开"
75="配置文件"
76="警告！"
77="恢复默认设置，会删除 Windows 防火墙。你要继续吗?"
78="无法启动Windows防火墙服务！"
79="Windows防火墙未运行！"
80="Windows防火墙配置存在问题！"
81="无法创建文件！"
82="无法读取文件！"
83="操作失败。"
84="&Netsh Commands"
85="&Import Firewall Config"
86="&Export Firewall Config"
